DataProcessors/Renault_ПодборКомплексСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ПодборКомплексСервисов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКомплексов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предложение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПредложенияКомплексСервисов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеПредложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регламентированное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбранныйКС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КомплексСервисыАвторабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСостав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетМаслаВБочках</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСоставВывод</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставВывод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетМаслаВБочках</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКритериевАвтомобиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеЗначенияКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КритерииАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКритерииОтбор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеЗначенияКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КритерииАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АвтоработаНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПредложенияКомплексСервисов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеПредложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ДополнительныеПредложения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регламентированное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплексСервис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КомплексСервисыАвторабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предложение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПредложенияКомплексСервисов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ТарифЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаТарифа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_ПодборКомплексСервисов/Ext/ObjectModule.bsl
Процедура ЗаполнитьТаблицуСостава(Комплекс,ДополнительныеПредложения,ТаблицаСоставВывод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Renault_ТарифЦен.Цена) КАК Цена,
		|	Renault_ТарифЦен.Артикул
		|ПОМЕСТИТЬ Цены
		|ИЗ
		|	РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
		|ГДЕ
		|	Renault_ТарифЦен.ТипЦены = &ТипЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_ТарифЦен.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_КомплексСервисыАвторабот.Авторабота,
		|	Renault_КомплексСервисыАвторабот.ИтогоНЧ,
		|	ВЫБОР
		|		КОГДА &ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.Renault_ТарифныеЗоны.ТЗ1)
		|			ТОГДА Renault_КомплексСервисыАвторабот.Цена1ТЗ
		|		ИНАЧЕ Renault_КомплексСервисыАвторабот.Цена2ТЗ
		|	КОНЕЦ КАК ЦенаРаботы,
		|	NULL КАК Запчасть,
		|	NULL КАК Количество,
		|	NULL КАК ЦенаЗЧ,
		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020
		|	NULL КАК УчетМаслаВБочках,
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020.
		|	NULL КАК Кратность
		|ИЗ
		|	Справочник.Renault_КомплексСервисыАвторабот КАК Renault_КомплексСервисыАвторабот
		|ГДЕ
		|	Renault_КомплексСервисыАвторабот.Ссылка = &Комплекс
		//+++
		//Не будем показывать помеченные на удаление
		|	И Renault_КомплексСервисыАвторабот.Ссылка.ПометкаУдаления = Ложь
		//---
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Номенклатура,
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Количество,
		//Приоритет комплекс сервиса а не тарфиа поэтому цену берем из справочника
		//+++
		//|	ЕСТЬNULL(Цены.Цена, Renault_КомплексСервисыАвтоработСоставКомплекса.ЦенаPCL),
		|	ЕСТЬNULL(Renault_КомплексСервисыАвтоработСоставКомплекса.ЦенаPCL,0),
		//---
		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.УчетМаслаВБочках,
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020.
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Кратность
		|ИЗ
		|	Справочник.Renault_КомплексСервисыАвторабот.СоставКомплекса КАК Renault_КомплексСервисыАвтоработСоставКомплекса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
		|		ПО Renault_КомплексСервисыАвтоработСоставКомплекса.Артикул = Цены.Артикул
		|ГДЕ
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Ссылка = &Комплекс
		//+++
		//Не будем показывать помеченные на удаление
		|	И Renault_КомплексСервисыАвтоработСоставКомплекса.Ссылка.ПометкаУдаления = Ложь
		//---

		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020 
		|	И &УсловиеУчетМаслаВБочках 
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020. 
		| ";
	
	ДилерскийЦентр=Renault_CRM.ПолучитьДилерскийЦентрПользователя();	
	Запрос.УстановитьПараметр("Комплекс", Комплекс);
	Запрос.УстановитьПараметр("ТипЦены",ДилерскийЦентр.Автосервис_ТипЦенПродажи);
	//Запрос.УстановитьПараметр("УчитыватьПодразделение", ДилерскийЦентр.Автосервис_УчитыватьПодразделениеВТипеЦен);
	//Запрос.УстановитьПараметр("ПодразделениеКомпании", ПараметрыСеанса.ПодразделениеКомпании);
	//Запрос.УстановитьПараметр("ПодразделениеКомпанииРодитель", ПараметрыСеанса.ПодразделениеКомпании.Родитель);
	
	ТарифнаяЗона = Renault_CRM.ПолучитьДилерскийЦентрПользователя().Автосервис_ТарифнаяЗона;
	Если НЕ ЗначениеЗаполнено(ТарифнаяЗона) Тогда
		ТарифнаяЗона = Справочники.Renault_ТарифныеЗоны.ТЗ1;
	КонецЕсли;
	Запрос.УстановитьПараметр("ТарифнаяЗона",ТарифнаяЗона);		
	
	// { DMSREN-382 Болдарев Д.Е. от 26.02.2020 
	УчетМаслаВБочках = ДилерскийЦентр.КомплексСервис_УчетМаслаВБочках;
	
	Если НЕ УчетМаслаВБочках Тогда
		// Можем отфильтровать лишнюю строку (масло в бочках) условием в запросе
		ПодстрокаЗамены = "НЕ Renault_КомплексСервисыАвтоработСоставКомплекса.УчетМаслаВБочках";		
	Иначе
		ПодстрокаЗамены = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеУчетМаслаВБочках", ПодстрокаЗамены);
	// } DMSREN-382 Болдарев Д.Е. от 26.02.2020. 
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСоставВывод.Очистить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		новСтрРаботы=ТаблицаСоставВывод.Добавить();
		новСтрРаботы.Состав = Выборка.Авторабота;
		новСтрРаботы.СоставВывод = "Работа: " + Выборка.Авторабота+ " "+ Комплекс.Артикул;	
		новСтрРаботы.Количество = Выборка.ИтогоНЧ;
		новСтрРаботы.Цена = Выборка.ЦенаРаботы;
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Запчасть = NULL Тогда 
				Продолжить;
			КонецЕсли;
			новСтр=ТаблицаСоставВывод.Добавить();
			новСтр.Состав = Выборка.Запчасть;
			новСтр.СоставВывод = "Запчасть: "+Выборка.Запчасть;
			новСтр.Количество  = Выборка.Количество;
			
			Если новСтр.Количество = 0 Тогда
				новСтр.Количество = 1;
			КонецЕсли;
			
			Если Найти(СтрЗаменить(НовСтр.СоставВывод," ",""),СтрЗаменить(Выборка.Запчасть.Артикул," ","")) = 0 Тогда
				НовСтр.СоставВывод = НовСтр.СоставВывод+ " "+Выборка.Запчасть.Артикул;
			КонецЕсли;
			//+++
			//Уберем расчет НДС т.к. в стоимости уже заложена цена ндс
			//МножительНДС = (1 + Выборка.Запчасть.СтавкаНДС.Ставка/100);
			//новСтр.Цена = МножительНДС * Выборка.ЦенаЗЧ;
		    //---
			Если ТипЗнч(Выборка.Запчасть) = Тип("СправочникСсылка.Номенклатура") Тогда
				Артикул = ВРег(Выборка.Запчасть.Артикул);
				Если Выборка.Кратность <> 0 Тогда
					//Уже скорректирована цена на НДС выше
					//новСтр.Цена = МножительНДС * новСтр.Цена/Выборка.Кратность * новСтр.Количество;
					новСтр.Количество = Выборка.Количество/Выборка.Кратность; 
					новСтр.Цена = Выборка.ЦенаЗЧ;
					ЦенаДляВычетаИзРабот = новСтр.Цена*новСтр.Количество;
				//+++	
				//ИначеЕсли Найти(Артикул,"0W30") = 0 
				//	И Найти(Артикул,"0W40") = 0 
				//	И Найти(Артикул,"5W30") = 0 
				//	И Найти(Артикул,"5W40") = 0 Тогда
				//ИначеЕсли Найти(НовСтр.СоставВывод,"0W30") = 0 
				//	И Найти(НовСтр.СоставВывод,"0W40") = 0 
				//	И Найти(НовСтр.СоставВывод,"5W30") = 0 
				//	И Найти(НовСтр.СоставВывод,"5W40") = 0 Тогда
					//Уже скорректирована цена на НДС выше
					//новСтр.Цена = МножительНДС * Выборка.ЦенаЗЧ * новСтр.Количество;
					//новСтр.Цена = Выборка.ЦенаЗЧ * новСтр.Количество;
				Иначе 
					новСтр.Цена = Выборка.ЦенаЗЧ;
					ЦенаДляВычетаИзРабот = новСтр.Цена;
					//+++
				КонецЕсли;
				новСтр.УчетМаслаВБочках = Выборка.УчетМаслаВБочках;
			КонецЕсли;
			новСтрРаботы.Цена = новСтрРаботы.Цена - ЦенаДляВычетаИзРабот;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДополнительныеПредложения) Тогда
			новСтрРаботы=ТаблицаСоставВывод.Добавить();
			новСтрРаботы.СоставВывод = "Бонус: " + ДополнительныеПредложения;	
			новСтрРаботы.Количество = 1;
			новСтрРаботы.Цена = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	// { DMSREN-382 Болдарев Д.Е. от 26.02.2020 
	Если УчетМаслаВБочках Тогда
		// Эту ситуацию обрабатываем отдельно
		НайденнаяСтрока = ТаблицаСоставВывод.Найти(Истина, "УчетМаслаВБочках");
		Если НайденнаяСтрока <> Неопределено Тогда
			// Ищем и удаляем строку с такой же номенклатурой, но учет в литрах
			Парам = Новый Структура("Состав,УчетМаслаВБочках", НайденнаяСтрока.Состав, Ложь);
			НайденныеСтроки = ТаблицаСоставВывод.НайтиСтроки(Парам);
			Для каждого ТекНайденная Из НайденныеСтроки Цикл
				//+++
				//Первой строкой идет общая сумма работы, а так как мы удаляем позиции, то их стоимость надо вернуть обратно
				ТаблицаСоставВывод[0].Цена = ТаблицаСоставВывод[0].Цена + ТекНайденная.Цена;
				//---
				ТаблицаСоставВывод.Удалить(ТекНайденная);
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли;
	
	// } DMSREN-382 Болдарев Д.Е. от 26.02.2020. 
	
КонецПроцедуры


Функция ЗаполнитьСоставПоКомплексу(Комплекс,ТаблицаДанных,ДилерскийЦентр=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Renault_ТарифЦен.Цена) КАК Цена,
		|	Renault_ТарифЦен.Артикул
		|ПОМЕСТИТЬ Цены
		|ИЗ
		|	РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
		|ГДЕ
		|	Renault_ТарифЦен.ТипЦены = &ТипЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_ТарифЦен.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_КомплексСервисыАвторабот.Авторабота,
		|	Renault_КомплексСервисыАвторабот.ИтогоНЧ,
		|	ВЫБОР
		|		КОГДА &ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.Renault_ТарифныеЗоны.ТЗ1)
		|			ТОГДА Renault_КомплексСервисыАвторабот.Цена1ТЗ
		|		ИНАЧЕ Renault_КомплексСервисыАвторабот.Цена2ТЗ
		|	КОНЕЦ КАК ЦенаРаботы,
		|	NULL КАК Запчасть,
		|	NULL КАК Количество,
		|	NULL КАК ЦенаЗЧ,
		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020
		|	NULL КАК УчетМаслаВБочках,
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020.
		|	NULL КАК Кратность
		|ИЗ
		|	Справочник.Renault_КомплексСервисыАвторабот КАК Renault_КомплексСервисыАвторабот
		|ГДЕ
		|	Renault_КомплексСервисыАвторабот.Ссылка = &Комплекс
		//+++
		//Не будем показывать помеченные на удаление
		|	И Renault_КомплексСервисыАвторабот.Ссылка.ПометкаУдаления = Ложь
		//---
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Номенклатура,
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Количество,
		//Приоритет комплекс сервиса а не тарфиа поэтому цену берем из справочника
		//+++
		//еще одна правка DMSREN-891, берем исключительно из тарифа, если пусто то оставляем 0  
		|	ЕСТЬNULL(Цены.Цена, Renault_КомплексСервисыАвтоработСоставКомплекса.ЦенаPCL),
		//|	ЕСТЬNULL(Renault_КомплексСервисыАвтоработСоставКомплекса.ЦенаPCL,0),
		//|	ЕСТЬNULL(Цены.Цена, 0),
		//---
		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.УчетМаслаВБочках,
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020.
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Кратность
		|ИЗ
		|	Справочник.Renault_КомплексСервисыАвторабот.СоставКомплекса КАК Renault_КомплексСервисыАвтоработСоставКомплекса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
		|		ПО Renault_КомплексСервисыАвтоработСоставКомплекса.Артикул = Цены.Артикул
		|ГДЕ
		|	Renault_КомплексСервисыАвтоработСоставКомплекса.Ссылка = &Комплекс
		//+++
		//Не будем показывать помеченные на удаление
		|	И Renault_КомплексСервисыАвтоработСоставКомплекса.Ссылка.ПометкаУдаления = Ложь
		//---

		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020 
		|	И &УсловиеУчетМаслаВБочках 
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020. 
		| ";
		
		Если ДилерскийЦентр = Неопределено Тогда 
			ДилерскийЦентр=Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		КонецЕсли;
	
		Запрос.УстановитьПараметр("Комплекс", Комплекс);
		Запрос.УстановитьПараметр("ТипЦены",ДилерскийЦентр.Автосервис_ТипЦенПродажи);
		ТарифнаяЗона = ДилерскийЦентр.Автосервис_ТарифнаяЗона;  // DMSREN-1265
		Если НЕ ЗначениеЗаполнено(ТарифнаяЗона) Тогда
			ТарифнаяЗона = Справочники.Renault_ТарифныеЗоны.ТЗ1;
		КонецЕсли;
		Запрос.УстановитьПараметр("ТарифнаяЗона",ТарифнаяЗона);		
		
		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020 
		УчетМаслаВБочках = ДилерскийЦентр.КомплексСервис_УчетМаслаВБочках;
		
		Если НЕ УчетМаслаВБочках Тогда
			// Можем отфильтровать лишнюю строку (масло в бочках) условием в запросе
			ПодстрокаЗамены = "НЕ Renault_КомплексСервисыАвтоработСоставКомплекса.УчетМаслаВБочках";		
		Иначе
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеУчетМаслаВБочках", ПодстрокаЗамены);
		
		Если ТаблицаДанных.Колонки.Найти("УчетМаслаВБочках") = Неопределено Тогда
			ТаблицаДанных.Колонки.Добавить("УчетМаслаВБочках");
		КонецЕсли; 
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020. 
		
		//Сергеев В.Н. DMSREN-1018
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(12,2);
		Если ТаблицаДанных.Колонки.Найти("ОстатокНаСкладе") = Неопределено Тогда  // DMSREN-1149. Добавил проверку что колонка уже есть (на случай выброра нескольких КС)
			ТаблицаДанных.Колонки.Добавить("ОстатокНаСкладе",Новый ОписаниеТипов(Массив, , ,КЧ));
		КонецЕсли;
		//----------

		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаСоставВывод.Очистить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			новСтрРаботы = ТаблицаДанных.Добавить();
			новСтрРаботы.Работа = Выборка.Авторабота;	
			новСтрРаботы.ДлительностьЗН = Выборка.ИтогоНЧ;	
			новСтрРаботы.Длительность = Выборка.ИтогоНЧ;	
			новСтрРаботы.Цена = Выборка.ЦенаРаботы;	
			новСтрРаботы.Стоимость = Выборка.ЦенаРаботы;
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Запчасть = NULL Тогда 
					Продолжить;
				КонецЕсли;
				
				новСтр = ТаблицаДанных.Добавить();
				
				Если ТипЗнч(Выборка.Запчасть) = Тип("СправочникСсылка.Номенклатура") Тогда	
					новСтр.Номенклатура = Выборка.Запчасть;	
					новСтр.Количество = Выборка.Количество;	
					НовСтр.ОстатокНаСкладе = Renault_АвтосервисОбщий.Renault_ПроверитьОстатокНаСкладе(НовСтр.Номенклатура, ДилерскийЦентр.Автосервис_СкладПоУмолчанию); //Сергеев В.Н. DMSREN-1018
					Если новСтр.Количество = 0 Тогда
						новСтр.Количество = 1;
					КонецЕсли;
					//МножительНДС = (1 + Выборка.Запчасть.СтавкаНДС.Ставка/100);
					//новСтр.Стоимость = МножительНДС * Выборка.ЦенаЗЧ;
					//новСтр.Цена = новСтр.Стоимость / новСтр.Количество;	
					Артикул = ВРег(Выборка.Запчасть.Артикул);
					Если Выборка.Кратность <> 0 Тогда
						новСтр.Количество = Окр(Выборка.Количество/Выборка.Кратность,2); 
						новСтр.Цена = Выборка.ЦенаЗЧ;
						новСтр.Стоимость = (Выборка.ЦенаЗЧ*новСтр.Количество);
					Иначе
						новСтр.Стоимость = Выборка.ЦенаЗЧ;
						новСтр.Цена = новСтр.Стоимость/новСтр.Количество;	
					КонецЕсли;
					новСтр.УчетМаслаВБочках = Выборка.УчетМаслаВБочках;
				Иначе
					Продолжить;
				КонецЕсли;
				новСтрРаботы.Стоимость = новСтрРаботы.Стоимость - новСтр.Стоимость;
			КонецЦикла;
		КонецЕсли;	
		
		
		// { DMSREN-382 Болдарев Д.Е. от 26.02.2020 
		Если УчетМаслаВБочках Тогда
			// Эту ситуацию обрабатываем отдельно
			НайденнаяСтрока = ТаблицаДанных.Найти(Истина, "УчетМаслаВБочках");
			Если НайденнаяСтрока <> Неопределено Тогда
				// Ищем и удаляем строку с такой же номенклатурой, но учет в литрах
				Парам = Новый Структура("Номенклатура,УчетМаслаВБочках", НайденнаяСтрока.Номенклатура, Ложь);
				НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Парам);
				Для каждого ТекНайденная Из НайденныеСтроки Цикл
					//+++Добавим стоимость к удаленной запчасти к стоимости работ
					ТаблицаДанных[0].Стоимость = ТаблицаДанных[0].Стоимость + ТекНайденная.Стоимость;
					//---
					ТаблицаДанных.Удалить(ТекНайденная);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		ТаблицаДанных.Колонки.Удалить("УчетМаслаВБочках");
		// } DMSREN-382 Болдарев Д.Е. от 26.02.2020. 
	
	
		Возврат ТаблицаДанных;
	
КонецФункции;
